Dlubal.RFEM5.AverageRegionProjectionType
Average region projection in direction

Dlubal.RFEM5.AverageRegionProjectionType.UnknownAverageRegionProjectionType
Unknown type of average region projection

Dlubal.RFEM5.AverageRegionProjectionType.PerpendicularProjection
Perpendicular projection

Dlubal.RFEM5.AverageRegionProjectionType.ProjectionInX
Projection in direction X

Dlubal.RFEM5.AverageRegionProjectionType.ProjectionInY
Projection in direction Y

Dlubal.RFEM5.AverageRegionProjectionType.ProjectionInZ
Projection in direction Z

Dlubal.RFEM5.AverageRegionProjectionType.ProjectionVector
Projection in defined vector